## 🔍 Terraform Plan - dev Environment

```

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.glue_job.aws_glue_job.this has been deleted
  - resource "aws_glue_job" "this" {
      - arn                       = "arn:aws:glue:sa-east-1:973516475030:job/dev-glue-job" -> null
        id                        = "dev-glue-job"
      - name                      = "dev-glue-job" -> null
        tags                      = {}
        # (14 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.glue_job.aws_glue_job.this will be created
  + resource "aws_glue_job" "this" {
      + arn               = (known after apply)
      + default_arguments = {
          + "--OUTPUT_PATH" = "s3://dev-glue-script-bucket-11022/output/"
        }
      + glue_version      = "5.0"
      + id                = (known after apply)
      + job_mode          = (known after apply)
      + max_capacity      = 2
      + name              = "dev-glue-job"
      + number_of_workers = (known after apply)
      + region            = "sa-east-1"
      + role_arn          = "arn:aws:iam::973516475030:role/glue-dev-role"
      + tags_all          = (known after apply)
      + timeout           = 30
      + worker_type       = (known after apply)

      + command {
          + name            = "glueetl"
          + python_version  = (known after apply)
          + runtime         = (known after apply)
          + script_location = "s3://dev-glue-script-bucket-11022/scripts/dev_glue_script.py"
        }
    }

  # module.s3_bucket.aws_s3_object.script will be updated in-place
  ~ resource "aws_s3_object" "script" {
      ~ etag                   = "b2215a3f6c8c52a40c6a33af494ec6e5" -> "105adb361011285ae1f9b490ee7c075f"
        id                     = "dev-glue-script-bucket-11022/scripts/dev_glue_script.py"
      ~ source                 = "scripts/dev_glue_script.py" -> "/home/runner/work/terrafoem-glue-setup/terrafoem-glue-setup/scripts/etl_job.py"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ glue_job_arn   = "arn:aws:glue:sa-east-1:973516475030:job/dev-glue-job" -> (known after apply)

```